## Staging: load_balancer
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 9 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                                         NAME                                          |
|--------|---------------------------------------------------------------------------------------|
| add    | `aws_acm_certificate.ai_answers`                                                      |
|        | `aws_acm_certificate_validation.ai_answers`                                           |
|        | `aws_lb.ai_answers`                                                                   |
|        | `aws_lb_listener.ai_answers_listener`                                                 |
|        | `aws_lb_target_group.ai_answers`                                                      |
|        | `aws_route53_record.ai_answers`                                                       |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;*.ai-answers.cdssandbox.xyz&quot;]` |
|        | `aws_route53_record.ai_answers_certificate_validation[&quot;ai-answers.cdssandbox.xyz&quot;]`   |
|        | `aws_security_group.ai_answers_load_balancer_sg`                                      |


</details>


**✂ &nbsp; Warning:** plan has been truncated! See the [full plan in the logs](https://github.com/cds-snc/ai-answers/actions/runs/13200819831).
<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
[0;90m13:28:53.316[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + create
[0;90m13:28:53.316[0m [0;37mSTDOUT[0m [0;36mterraform: [0mTerraform will perform the following actions:
[0;90m13:28:53.316[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_acm_certificate.ai_answers will be created
[0;90m13:28:53.316[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_acm_certificate" "ai_answers" {
[0;90m13:28:53.316[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                       = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + domain_name               = "ai-answers.cdssandbox.xyz"
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + domain_validation_options = [
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + domain_name           = "*.ai-answers.cdssandbox.xyz"
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_name  = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_type  = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_value = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + domain_name           = "ai-answers.cdssandbox.xyz"
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_name  = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_type  = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + resource_record_value = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                        = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + key_algorithm             = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + not_after                 = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + not_before                = (known after apply)
[0;90m13:28:53.317[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + pending_renewal           = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + renewal_eligibility       = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + renewal_summary           = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + status                    = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subject_alternative_names = [
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "*.ai-answers.cdssandbox.xyz",
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "ai-answers.cdssandbox.xyz",
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                      = {
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                  = {
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type                      = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + validation_emails         = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + validation_method         = "DNS"
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + options (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_acm_certificate_validation.ai_answers will be created
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_acm_certificate_validation" "ai_answers" {
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + certificate_arn         = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                      = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + validation_record_fqdns = (known after apply)
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_lb.ai_answers will be created
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_lb" "ai_answers" {
[0;90m13:28:53.318[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                                          = (known after apply)
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn_suffix                                                   = (known after apply)
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + client_keep_alive                                            = 3600
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + desync_mitigation_mode                                       = "defensive"
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + dns_name                                                     = (known after apply)
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + drop_invalid_header_fields                                   = true
[0;90m13:28:53.319[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_deletion_protection                                   = true
[0;90m13:28:53.322[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_http2                                                 = true
[0;90m13:28:53.322[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_tls_version_and_cipher_suite_headers                  = false
[0;90m13:28:53.322[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_waf_fail_open                                         = false
[0;90m13:28:53.323[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enable_xff_client_port                                       = false
[0;90m13:28:53.323[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + enforce_security_group_inbound_rules_on_private_link_traffic = (known after apply)
[0;90m13:28:53.323[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                                           = (known after apply)
[0;90m13:28:53.323[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + idle_timeout                                                 = 60
[0;90m13:28:53.323[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + internal                                                     = false
[0;90m13:28:53.324[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ip_address_type                                              = (known after apply)
[0;90m13:28:53.324[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancer_type                                           = "application"
[0;90m13:28:53.324[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                                                         = "ai-answers-lb"
[0;90m13:28:53.325[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix                                                  = (known after apply)
[0;90m13:28:53.325[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preserve_host_header                                         = false
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + security_groups                                              = (known after apply)
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnets                                                      = [
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "subnet-0bf150cb1ad932800",
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "subnet-0d3c0e10e6fd0e4bf",
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:28:53.326[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                                                         = {
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                                     = {
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                                                       = (known after apply)
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + xff_header_processing_mode                                   = "append"
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id                                                      = (known after apply)
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + subnet_mapping (known after apply)
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.327[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_lb_listener.ai_answers_listener will be created
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_lb_listener" "ai_answers_listener" {
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                                                   = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + certificate_arn                                                       = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                                                    = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancer_arn                                                     = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                                                                  = 443
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + protocol                                                              = "HTTPS"
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_header_name               = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_issuer_header_name        = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_leaf_header_name          = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_serial_number_header_name = (known after apply)
[0;90m13:28:53.328[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_subject_header_name       = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_mtls_clientcert_validity_header_name      = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_tls_cipher_suite_header_name              = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_request_x_amzn_tls_version_header_name                   = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_allow_credentials_header_value   = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_allow_headers_header_value       = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_allow_methods_header_value       = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_allow_origin_header_value        = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_expose_headers_header_value      = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_access_control_max_age_header_value             = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_content_security_policy_header_value            = (known after apply)
[0;90m13:28:53.329[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_server_enabled                                  = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_strict_transport_security_header_value          = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_x_content_type_options_header_value             = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + routing_http_response_x_frame_options_header_value                    = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ssl_policy                                                            = "ELBSecurityPolicy-TLS13-1-2-2021-06"
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                                                              = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tcp_idle_timeout_seconds                                              = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + default_action {
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + order            = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + target_group_arn = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + type             = "forward"
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + mutual_authentication (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_lb_target_group.ai_answers will be created
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_lb_target_group" "ai_answers" {
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                                = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn_suffix                         = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + connection_termination             = (known after apply)
[0;90m13:28:53.330[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + deregistration_delay               = "30"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                                 = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ip_address_type                    = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + lambda_multi_value_headers_enabled = false
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancer_arns                 = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancing_algorithm_type      = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancing_anomaly_mitigation  = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + load_balancing_cross_zone_enabled  = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                               = "ai-answers"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix                        = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + port                               = 3001
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + preserve_client_ip                 = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + protocol                           = "HTTP"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + protocol_version                   = "HTTP1"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + proxy_protocol_v2                  = false
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + slow_start                         = 0
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                               = {
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all                           = {
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_type                        = "ip"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                             = "vpc-0659c9b2d7046368f"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + health_check {
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + enabled             = true
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + healthy_threshold   = 2
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + interval            = 60
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + matcher             = (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + path                = "/health"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + port                = "traffic-port"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + protocol            = "HTTP"
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + timeout             = 30
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + unhealthy_threshold = 2
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + stickiness (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_failover (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_group_health (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + target_health_state (known after apply)
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_record.ai_answers will be created
[0;90m13:28:53.331[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route53_record" "ai_answers" {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allow_overwrite = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + fqdn            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id              = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        name            = null
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type            = "A"
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id         = "Z0155535SR6XQTKZDGDA"
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + alias {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + evaluate_target_health = false
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + name                   = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + zone_id                = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_record.ai_answers_certificate_validation["*.ai-answers.cdssandbox.xyz"] will be created
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route53_record" "ai_answers_certificate_validation" {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allow_overwrite = true
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + fqdn            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id              = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + records         = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ttl             = 60
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id         = "Z0155535SR6XQTKZDGDA"
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_route53_record.ai_answers_certificate_validation["ai-answers.cdssandbox.xyz"] will be created
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_route53_record" "ai_answers_certificate_validation" {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + allow_overwrite = true
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + fqdn            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id              = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + records         = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ttl             = 60
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + type            = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + zone_id         = "Z0155535SR6XQTKZDGDA"
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  # aws_security_group.ai_answers_load_balancer_sg will be created
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + resource "aws_security_group" "ai_answers_load_balancer_sg" {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + arn                    = (known after apply)
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + description            = "Security group for load balancer"
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + egress                 = [
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = [
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "10.0.0.0/16",
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m13:28:53.332[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 3001
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "tcp"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 3001
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                # (1 unchanged attribute hidden)
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + id                     = (known after apply)
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + ingress                = [
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + {
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + cidr_blocks      = [
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                  + "0.0.0.0/0",
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m                ]
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + description      = "Allow HTTPS inbound traffic"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + from_port        = 443
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + ipv6_cidr_blocks = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + prefix_list_ids  = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + protocol         = "tcp"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + security_groups  = []
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + self             = false
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m              + to_port          = 443
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m            },
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        ]
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name                   = "ai_answers_load_balancer_sg"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + name_prefix            = (known after apply)
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + owner_id               = (known after apply)
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + revoke_rules_on_delete = false
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags                   = {
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + tags_all               = {
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m          + "CostCentre" = "ai-answers-staging"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m        }
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + vpc_id                 = "vpc-0659c9b2d7046368f"
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m    }
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0mPlan: 9 to add, 0 to change, 0 to destroy.
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0mChanges to Outputs:
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + ai_answers_load_balancer_sg = (known after apply)
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m  + lb_listener                 = {
[0;90m13:28:53.333[0m [0;37mSTDOUT[0m [0;36mterraform: [0m      + alpn_policy          ...
```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_listener.ai_answers_listener"]
WARN - plan.json - main - Missing Common Tags: ["aws_lb_target_group.ai_answers"]
WARN - plan.json - main - Missing Common Tags: ["aws_security_group.ai_answers_load_balancer_sg"]

24 tests, 19 passed, 5 warnings, 0 failures, 0 exceptions

```

</details>
